; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l13-t1-p2---int100n150-m25---int100c150---s177---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 l3 l4 l5 l6 l7 l8 l9 l10 l11 l12 - location
t0 - truck
p0 p1 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 level37 level38 level39 level40 level41 level42 level43 level44 level45 level46 level47 level48 level49 level50 level51 level52 level53 level54 level55 level56 level57 level58 level59 level60 level61 level62 level63 level64 level65 level66 level67 level68 level69 level70 level71 level72 level73 level74 level75 - fuellevel
)

(:init
(sum level0 level1 level1)
(sum level0 level3 level3)
(sum level0 level6 level6)
(sum level0 level7 level7)
(sum level0 level8 level8)
(sum level0 level9 level9)
(sum level0 level12 level12)
(sum level0 level13 level13)
(sum level0 level14 level14)
(sum level0 level17 level17)
(sum level0 level18 level18)
(sum level0 level21 level21)
(sum level0 level23 level23)
(sum level0 level25 level25)
(sum level1 level1 level2)
(sum level1 level3 level4)
(sum level1 level6 level7)
(sum level1 level7 level8)
(sum level1 level8 level9)
(sum level1 level9 level10)
(sum level1 level12 level13)
(sum level1 level13 level14)
(sum level1 level14 level15)
(sum level1 level17 level18)
(sum level1 level18 level19)
(sum level1 level21 level22)
(sum level1 level23 level24)
(sum level1 level25 level26)
(sum level2 level1 level3)
(sum level2 level3 level5)
(sum level2 level6 level8)
(sum level2 level7 level9)
(sum level2 level8 level10)
(sum level2 level9 level11)
(sum level2 level12 level14)
(sum level2 level13 level15)
(sum level2 level14 level16)
(sum level2 level17 level19)
(sum level2 level18 level20)
(sum level2 level21 level23)
(sum level2 level23 level25)
(sum level2 level25 level27)
(sum level3 level1 level4)
(sum level3 level3 level6)
(sum level3 level6 level9)
(sum level3 level7 level10)
(sum level3 level8 level11)
(sum level3 level9 level12)
(sum level3 level12 level15)
(sum level3 level13 level16)
(sum level3 level14 level17)
(sum level3 level17 level20)
(sum level3 level18 level21)
(sum level3 level21 level24)
(sum level3 level23 level26)
(sum level3 level25 level28)
(sum level4 level1 level5)
(sum level4 level3 level7)
(sum level4 level6 level10)
(sum level4 level7 level11)
(sum level4 level8 level12)
(sum level4 level9 level13)
(sum level4 level12 level16)
(sum level4 level13 level17)
(sum level4 level14 level18)
(sum level4 level17 level21)
(sum level4 level18 level22)
(sum level4 level21 level25)
(sum level4 level23 level27)
(sum level4 level25 level29)
(sum level5 level1 level6)
(sum level5 level3 level8)
(sum level5 level6 level11)
(sum level5 level7 level12)
(sum level5 level8 level13)
(sum level5 level9 level14)
(sum level5 level12 level17)
(sum level5 level13 level18)
(sum level5 level14 level19)
(sum level5 level17 level22)
(sum level5 level18 level23)
(sum level5 level21 level26)
(sum level5 level23 level28)
(sum level5 level25 level30)
(sum level6 level1 level7)
(sum level6 level3 level9)
(sum level6 level6 level12)
(sum level6 level7 level13)
(sum level6 level8 level14)
(sum level6 level9 level15)
(sum level6 level12 level18)
(sum level6 level13 level19)
(sum level6 level14 level20)
(sum level6 level17 level23)
(sum level6 level18 level24)
(sum level6 level21 level27)
(sum level6 level23 level29)
(sum level6 level25 level31)
(sum level7 level1 level8)
(sum level7 level3 level10)
(sum level7 level6 level13)
(sum level7 level7 level14)
(sum level7 level8 level15)
(sum level7 level9 level16)
(sum level7 level12 level19)
(sum level7 level13 level20)
(sum level7 level14 level21)
(sum level7 level17 level24)
(sum level7 level18 level25)
(sum level7 level21 level28)
(sum level7 level23 level30)
(sum level7 level25 level32)
(sum level8 level1 level9)
(sum level8 level3 level11)
(sum level8 level6 level14)
(sum level8 level7 level15)
(sum level8 level8 level16)
(sum level8 level9 level17)
(sum level8 level12 level20)
(sum level8 level13 level21)
(sum level8 level14 level22)
(sum level8 level17 level25)
(sum level8 level18 level26)
(sum level8 level21 level29)
(sum level8 level23 level31)
(sum level8 level25 level33)
(sum level9 level1 level10)
(sum level9 level3 level12)
(sum level9 level6 level15)
(sum level9 level7 level16)
(sum level9 level8 level17)
(sum level9 level9 level18)
(sum level9 level12 level21)
(sum level9 level13 level22)
(sum level9 level14 level23)
(sum level9 level17 level26)
(sum level9 level18 level27)
(sum level9 level21 level30)
(sum level9 level23 level32)
(sum level9 level25 level34)
(sum level10 level1 level11)
(sum level10 level3 level13)
(sum level10 level6 level16)
(sum level10 level7 level17)
(sum level10 level8 level18)
(sum level10 level9 level19)
(sum level10 level12 level22)
(sum level10 level13 level23)
(sum level10 level14 level24)
(sum level10 level17 level27)
(sum level10 level18 level28)
(sum level10 level21 level31)
(sum level10 level23 level33)
(sum level10 level25 level35)
(sum level11 level1 level12)
(sum level11 level3 level14)
(sum level11 level6 level17)
(sum level11 level7 level18)
(sum level11 level8 level19)
(sum level11 level9 level20)
(sum level11 level12 level23)
(sum level11 level13 level24)
(sum level11 level14 level25)
(sum level11 level17 level28)
(sum level11 level18 level29)
(sum level11 level21 level32)
(sum level11 level23 level34)
(sum level11 level25 level36)
(sum level12 level1 level13)
(sum level12 level3 level15)
(sum level12 level6 level18)
(sum level12 level7 level19)
(sum level12 level8 level20)
(sum level12 level9 level21)
(sum level12 level12 level24)
(sum level12 level13 level25)
(sum level12 level14 level26)
(sum level12 level17 level29)
(sum level12 level18 level30)
(sum level12 level21 level33)
(sum level12 level23 level35)
(sum level12 level25 level37)
(sum level13 level1 level14)
(sum level13 level3 level16)
(sum level13 level6 level19)
(sum level13 level7 level20)
(sum level13 level8 level21)
(sum level13 level9 level22)
(sum level13 level12 level25)
(sum level13 level13 level26)
(sum level13 level14 level27)
(sum level13 level17 level30)
(sum level13 level18 level31)
(sum level13 level21 level34)
(sum level13 level23 level36)
(sum level13 level25 level38)
(sum level14 level1 level15)
(sum level14 level3 level17)
(sum level14 level6 level20)
(sum level14 level7 level21)
(sum level14 level8 level22)
(sum level14 level9 level23)
(sum level14 level12 level26)
(sum level14 level13 level27)
(sum level14 level14 level28)
(sum level14 level17 level31)
(sum level14 level18 level32)
(sum level14 level21 level35)
(sum level14 level23 level37)
(sum level14 level25 level39)
(sum level15 level1 level16)
(sum level15 level3 level18)
(sum level15 level6 level21)
(sum level15 level7 level22)
(sum level15 level8 level23)
(sum level15 level9 level24)
(sum level15 level12 level27)
(sum level15 level13 level28)
(sum level15 level14 level29)
(sum level15 level17 level32)
(sum level15 level18 level33)
(sum level15 level21 level36)
(sum level15 level23 level38)
(sum level15 level25 level40)
(sum level16 level1 level17)
(sum level16 level3 level19)
(sum level16 level6 level22)
(sum level16 level7 level23)
(sum level16 level8 level24)
(sum level16 level9 level25)
(sum level16 level12 level28)
(sum level16 level13 level29)
(sum level16 level14 level30)
(sum level16 level17 level33)
(sum level16 level18 level34)
(sum level16 level21 level37)
(sum level16 level23 level39)
(sum level16 level25 level41)
(sum level17 level1 level18)
(sum level17 level3 level20)
(sum level17 level6 level23)
(sum level17 level7 level24)
(sum level17 level8 level25)
(sum level17 level9 level26)
(sum level17 level12 level29)
(sum level17 level13 level30)
(sum level17 level14 level31)
(sum level17 level17 level34)
(sum level17 level18 level35)
(sum level17 level21 level38)
(sum level17 level23 level40)
(sum level17 level25 level42)
(sum level18 level1 level19)
(sum level18 level3 level21)
(sum level18 level6 level24)
(sum level18 level7 level25)
(sum level18 level8 level26)
(sum level18 level9 level27)
(sum level18 level12 level30)
(sum level18 level13 level31)
(sum level18 level14 level32)
(sum level18 level17 level35)
(sum level18 level18 level36)
(sum level18 level21 level39)
(sum level18 level23 level41)
(sum level18 level25 level43)
(sum level19 level1 level20)
(sum level19 level3 level22)
(sum level19 level6 level25)
(sum level19 level7 level26)
(sum level19 level8 level27)
(sum level19 level9 level28)
(sum level19 level12 level31)
(sum level19 level13 level32)
(sum level19 level14 level33)
(sum level19 level17 level36)
(sum level19 level18 level37)
(sum level19 level21 level40)
(sum level19 level23 level42)
(sum level19 level25 level44)
(sum level20 level1 level21)
(sum level20 level3 level23)
(sum level20 level6 level26)
(sum level20 level7 level27)
(sum level20 level8 level28)
(sum level20 level9 level29)
(sum level20 level12 level32)
(sum level20 level13 level33)
(sum level20 level14 level34)
(sum level20 level17 level37)
(sum level20 level18 level38)
(sum level20 level21 level41)
(sum level20 level23 level43)
(sum level20 level25 level45)
(sum level21 level1 level22)
(sum level21 level3 level24)
(sum level21 level6 level27)
(sum level21 level7 level28)
(sum level21 level8 level29)
(sum level21 level9 level30)
(sum level21 level12 level33)
(sum level21 level13 level34)
(sum level21 level14 level35)
(sum level21 level17 level38)
(sum level21 level18 level39)
(sum level21 level21 level42)
(sum level21 level23 level44)
(sum level21 level25 level46)
(sum level22 level1 level23)
(sum level22 level3 level25)
(sum level22 level6 level28)
(sum level22 level7 level29)
(sum level22 level8 level30)
(sum level22 level9 level31)
(sum level22 level12 level34)
(sum level22 level13 level35)
(sum level22 level14 level36)
(sum level22 level17 level39)
(sum level22 level18 level40)
(sum level22 level21 level43)
(sum level22 level23 level45)
(sum level22 level25 level47)
(sum level23 level1 level24)
(sum level23 level3 level26)
(sum level23 level6 level29)
(sum level23 level7 level30)
(sum level23 level8 level31)
(sum level23 level9 level32)
(sum level23 level12 level35)
(sum level23 level13 level36)
(sum level23 level14 level37)
(sum level23 level17 level40)
(sum level23 level18 level41)
(sum level23 level21 level44)
(sum level23 level23 level46)
(sum level23 level25 level48)
(sum level24 level1 level25)
(sum level24 level3 level27)
(sum level24 level6 level30)
(sum level24 level7 level31)
(sum level24 level8 level32)
(sum level24 level9 level33)
(sum level24 level12 level36)
(sum level24 level13 level37)
(sum level24 level14 level38)
(sum level24 level17 level41)
(sum level24 level18 level42)
(sum level24 level21 level45)
(sum level24 level23 level47)
(sum level24 level25 level49)
(sum level25 level1 level26)
(sum level25 level3 level28)
(sum level25 level6 level31)
(sum level25 level7 level32)
(sum level25 level8 level33)
(sum level25 level9 level34)
(sum level25 level12 level37)
(sum level25 level13 level38)
(sum level25 level14 level39)
(sum level25 level17 level42)
(sum level25 level18 level43)
(sum level25 level21 level46)
(sum level25 level23 level48)
(sum level25 level25 level50)
(sum level26 level1 level27)
(sum level26 level3 level29)
(sum level26 level6 level32)
(sum level26 level7 level33)
(sum level26 level8 level34)
(sum level26 level9 level35)
(sum level26 level12 level38)
(sum level26 level13 level39)
(sum level26 level14 level40)
(sum level26 level17 level43)
(sum level26 level18 level44)
(sum level26 level21 level47)
(sum level26 level23 level49)
(sum level26 level25 level51)
(sum level27 level1 level28)
(sum level27 level3 level30)
(sum level27 level6 level33)
(sum level27 level7 level34)
(sum level27 level8 level35)
(sum level27 level9 level36)
(sum level27 level12 level39)
(sum level27 level13 level40)
(sum level27 level14 level41)
(sum level27 level17 level44)
(sum level27 level18 level45)
(sum level27 level21 level48)
(sum level27 level23 level50)
(sum level27 level25 level52)
(sum level28 level1 level29)
(sum level28 level3 level31)
(sum level28 level6 level34)
(sum level28 level7 level35)
(sum level28 level8 level36)
(sum level28 level9 level37)
(sum level28 level12 level40)
(sum level28 level13 level41)
(sum level28 level14 level42)
(sum level28 level17 level45)
(sum level28 level18 level46)
(sum level28 level21 level49)
(sum level28 level23 level51)
(sum level28 level25 level53)
(sum level29 level1 level30)
(sum level29 level3 level32)
(sum level29 level6 level35)
(sum level29 level7 level36)
(sum level29 level8 level37)
(sum level29 level9 level38)
(sum level29 level12 level41)
(sum level29 level13 level42)
(sum level29 level14 level43)
(sum level29 level17 level46)
(sum level29 level18 level47)
(sum level29 level21 level50)
(sum level29 level23 level52)
(sum level29 level25 level54)
(sum level30 level1 level31)
(sum level30 level3 level33)
(sum level30 level6 level36)
(sum level30 level7 level37)
(sum level30 level8 level38)
(sum level30 level9 level39)
(sum level30 level12 level42)
(sum level30 level13 level43)
(sum level30 level14 level44)
(sum level30 level17 level47)
(sum level30 level18 level48)
(sum level30 level21 level51)
(sum level30 level23 level53)
(sum level30 level25 level55)
(sum level31 level1 level32)
(sum level31 level3 level34)
(sum level31 level6 level37)
(sum level31 level7 level38)
(sum level31 level8 level39)
(sum level31 level9 level40)
(sum level31 level12 level43)
(sum level31 level13 level44)
(sum level31 level14 level45)
(sum level31 level17 level48)
(sum level31 level18 level49)
(sum level31 level21 level52)
(sum level31 level23 level54)
(sum level31 level25 level56)
(sum level32 level1 level33)
(sum level32 level3 level35)
(sum level32 level6 level38)
(sum level32 level7 level39)
(sum level32 level8 level40)
(sum level32 level9 level41)
(sum level32 level12 level44)
(sum level32 level13 level45)
(sum level32 level14 level46)
(sum level32 level17 level49)
(sum level32 level18 level50)
(sum level32 level21 level53)
(sum level32 level23 level55)
(sum level32 level25 level57)
(sum level33 level1 level34)
(sum level33 level3 level36)
(sum level33 level6 level39)
(sum level33 level7 level40)
(sum level33 level8 level41)
(sum level33 level9 level42)
(sum level33 level12 level45)
(sum level33 level13 level46)
(sum level33 level14 level47)
(sum level33 level17 level50)
(sum level33 level18 level51)
(sum level33 level21 level54)
(sum level33 level23 level56)
(sum level33 level25 level58)
(sum level34 level1 level35)
(sum level34 level3 level37)
(sum level34 level6 level40)
(sum level34 level7 level41)
(sum level34 level8 level42)
(sum level34 level9 level43)
(sum level34 level12 level46)
(sum level34 level13 level47)
(sum level34 level14 level48)
(sum level34 level17 level51)
(sum level34 level18 level52)
(sum level34 level21 level55)
(sum level34 level23 level57)
(sum level34 level25 level59)
(sum level35 level1 level36)
(sum level35 level3 level38)
(sum level35 level6 level41)
(sum level35 level7 level42)
(sum level35 level8 level43)
(sum level35 level9 level44)
(sum level35 level12 level47)
(sum level35 level13 level48)
(sum level35 level14 level49)
(sum level35 level17 level52)
(sum level35 level18 level53)
(sum level35 level21 level56)
(sum level35 level23 level58)
(sum level35 level25 level60)
(sum level36 level1 level37)
(sum level36 level3 level39)
(sum level36 level6 level42)
(sum level36 level7 level43)
(sum level36 level8 level44)
(sum level36 level9 level45)
(sum level36 level12 level48)
(sum level36 level13 level49)
(sum level36 level14 level50)
(sum level36 level17 level53)
(sum level36 level18 level54)
(sum level36 level21 level57)
(sum level36 level23 level59)
(sum level36 level25 level61)
(sum level37 level1 level38)
(sum level37 level3 level40)
(sum level37 level6 level43)
(sum level37 level7 level44)
(sum level37 level8 level45)
(sum level37 level9 level46)
(sum level37 level12 level49)
(sum level37 level13 level50)
(sum level37 level14 level51)
(sum level37 level17 level54)
(sum level37 level18 level55)
(sum level37 level21 level58)
(sum level37 level23 level60)
(sum level37 level25 level62)
(sum level38 level1 level39)
(sum level38 level3 level41)
(sum level38 level6 level44)
(sum level38 level7 level45)
(sum level38 level8 level46)
(sum level38 level9 level47)
(sum level38 level12 level50)
(sum level38 level13 level51)
(sum level38 level14 level52)
(sum level38 level17 level55)
(sum level38 level18 level56)
(sum level38 level21 level59)
(sum level38 level23 level61)
(sum level38 level25 level63)
(sum level39 level1 level40)
(sum level39 level3 level42)
(sum level39 level6 level45)
(sum level39 level7 level46)
(sum level39 level8 level47)
(sum level39 level9 level48)
(sum level39 level12 level51)
(sum level39 level13 level52)
(sum level39 level14 level53)
(sum level39 level17 level56)
(sum level39 level18 level57)
(sum level39 level21 level60)
(sum level39 level23 level62)
(sum level39 level25 level64)
(sum level40 level1 level41)
(sum level40 level3 level43)
(sum level40 level6 level46)
(sum level40 level7 level47)
(sum level40 level8 level48)
(sum level40 level9 level49)
(sum level40 level12 level52)
(sum level40 level13 level53)
(sum level40 level14 level54)
(sum level40 level17 level57)
(sum level40 level18 level58)
(sum level40 level21 level61)
(sum level40 level23 level63)
(sum level40 level25 level65)
(sum level41 level1 level42)
(sum level41 level3 level44)
(sum level41 level6 level47)
(sum level41 level7 level48)
(sum level41 level8 level49)
(sum level41 level9 level50)
(sum level41 level12 level53)
(sum level41 level13 level54)
(sum level41 level14 level55)
(sum level41 level17 level58)
(sum level41 level18 level59)
(sum level41 level21 level62)
(sum level41 level23 level64)
(sum level41 level25 level66)
(sum level42 level1 level43)
(sum level42 level3 level45)
(sum level42 level6 level48)
(sum level42 level7 level49)
(sum level42 level8 level50)
(sum level42 level9 level51)
(sum level42 level12 level54)
(sum level42 level13 level55)
(sum level42 level14 level56)
(sum level42 level17 level59)
(sum level42 level18 level60)
(sum level42 level21 level63)
(sum level42 level23 level65)
(sum level42 level25 level67)
(sum level43 level1 level44)
(sum level43 level3 level46)
(sum level43 level6 level49)
(sum level43 level7 level50)
(sum level43 level8 level51)
(sum level43 level9 level52)
(sum level43 level12 level55)
(sum level43 level13 level56)
(sum level43 level14 level57)
(sum level43 level17 level60)
(sum level43 level18 level61)
(sum level43 level21 level64)
(sum level43 level23 level66)
(sum level43 level25 level68)
(sum level44 level1 level45)
(sum level44 level3 level47)
(sum level44 level6 level50)
(sum level44 level7 level51)
(sum level44 level8 level52)
(sum level44 level9 level53)
(sum level44 level12 level56)
(sum level44 level13 level57)
(sum level44 level14 level58)
(sum level44 level17 level61)
(sum level44 level18 level62)
(sum level44 level21 level65)
(sum level44 level23 level67)
(sum level44 level25 level69)
(sum level45 level1 level46)
(sum level45 level3 level48)
(sum level45 level6 level51)
(sum level45 level7 level52)
(sum level45 level8 level53)
(sum level45 level9 level54)
(sum level45 level12 level57)
(sum level45 level13 level58)
(sum level45 level14 level59)
(sum level45 level17 level62)
(sum level45 level18 level63)
(sum level45 level21 level66)
(sum level45 level23 level68)
(sum level45 level25 level70)
(sum level46 level1 level47)
(sum level46 level3 level49)
(sum level46 level6 level52)
(sum level46 level7 level53)
(sum level46 level8 level54)
(sum level46 level9 level55)
(sum level46 level12 level58)
(sum level46 level13 level59)
(sum level46 level14 level60)
(sum level46 level17 level63)
(sum level46 level18 level64)
(sum level46 level21 level67)
(sum level46 level23 level69)
(sum level46 level25 level71)
(sum level47 level1 level48)
(sum level47 level3 level50)
(sum level47 level6 level53)
(sum level47 level7 level54)
(sum level47 level8 level55)
(sum level47 level9 level56)
(sum level47 level12 level59)
(sum level47 level13 level60)
(sum level47 level14 level61)
(sum level47 level17 level64)
(sum level47 level18 level65)
(sum level47 level21 level68)
(sum level47 level23 level70)
(sum level47 level25 level72)
(sum level48 level1 level49)
(sum level48 level3 level51)
(sum level48 level6 level54)
(sum level48 level7 level55)
(sum level48 level8 level56)
(sum level48 level9 level57)
(sum level48 level12 level60)
(sum level48 level13 level61)
(sum level48 level14 level62)
(sum level48 level17 level65)
(sum level48 level18 level66)
(sum level48 level21 level69)
(sum level48 level23 level71)
(sum level48 level25 level73)
(sum level49 level1 level50)
(sum level49 level3 level52)
(sum level49 level6 level55)
(sum level49 level7 level56)
(sum level49 level8 level57)
(sum level49 level9 level58)
(sum level49 level12 level61)
(sum level49 level13 level62)
(sum level49 level14 level63)
(sum level49 level17 level66)
(sum level49 level18 level67)
(sum level49 level21 level70)
(sum level49 level23 level72)
(sum level49 level25 level74)
(sum level50 level1 level51)
(sum level50 level3 level53)
(sum level50 level6 level56)
(sum level50 level7 level57)
(sum level50 level8 level58)
(sum level50 level9 level59)
(sum level50 level12 level62)
(sum level50 level13 level63)
(sum level50 level14 level64)
(sum level50 level17 level67)
(sum level50 level18 level68)
(sum level50 level21 level71)
(sum level50 level23 level73)
(sum level50 level25 level75)
(sum level51 level1 level52)
(sum level51 level3 level54)
(sum level51 level6 level57)
(sum level51 level7 level58)
(sum level51 level8 level59)
(sum level51 level9 level60)
(sum level51 level12 level63)
(sum level51 level13 level64)
(sum level51 level14 level65)
(sum level51 level17 level68)
(sum level51 level18 level69)
(sum level51 level21 level72)
(sum level51 level23 level74)
(sum level52 level1 level53)
(sum level52 level3 level55)
(sum level52 level6 level58)
(sum level52 level7 level59)
(sum level52 level8 level60)
(sum level52 level9 level61)
(sum level52 level12 level64)
(sum level52 level13 level65)
(sum level52 level14 level66)
(sum level52 level17 level69)
(sum level52 level18 level70)
(sum level52 level21 level73)
(sum level52 level23 level75)
(sum level53 level1 level54)
(sum level53 level3 level56)
(sum level53 level6 level59)
(sum level53 level7 level60)
(sum level53 level8 level61)
(sum level53 level9 level62)
(sum level53 level12 level65)
(sum level53 level13 level66)
(sum level53 level14 level67)
(sum level53 level17 level70)
(sum level53 level18 level71)
(sum level53 level21 level74)
(sum level54 level1 level55)
(sum level54 level3 level57)
(sum level54 level6 level60)
(sum level54 level7 level61)
(sum level54 level8 level62)
(sum level54 level9 level63)
(sum level54 level12 level66)
(sum level54 level13 level67)
(sum level54 level14 level68)
(sum level54 level17 level71)
(sum level54 level18 level72)
(sum level54 level21 level75)
(sum level55 level1 level56)
(sum level55 level3 level58)
(sum level55 level6 level61)
(sum level55 level7 level62)
(sum level55 level8 level63)
(sum level55 level9 level64)
(sum level55 level12 level67)
(sum level55 level13 level68)
(sum level55 level14 level69)
(sum level55 level17 level72)
(sum level55 level18 level73)
(sum level56 level1 level57)
(sum level56 level3 level59)
(sum level56 level6 level62)
(sum level56 level7 level63)
(sum level56 level8 level64)
(sum level56 level9 level65)
(sum level56 level12 level68)
(sum level56 level13 level69)
(sum level56 level14 level70)
(sum level56 level17 level73)
(sum level56 level18 level74)
(sum level57 level1 level58)
(sum level57 level3 level60)
(sum level57 level6 level63)
(sum level57 level7 level64)
(sum level57 level8 level65)
(sum level57 level9 level66)
(sum level57 level12 level69)
(sum level57 level13 level70)
(sum level57 level14 level71)
(sum level57 level17 level74)
(sum level57 level18 level75)
(sum level58 level1 level59)
(sum level58 level3 level61)
(sum level58 level6 level64)
(sum level58 level7 level65)
(sum level58 level8 level66)
(sum level58 level9 level67)
(sum level58 level12 level70)
(sum level58 level13 level71)
(sum level58 level14 level72)
(sum level58 level17 level75)
(sum level59 level1 level60)
(sum level59 level3 level62)
(sum level59 level6 level65)
(sum level59 level7 level66)
(sum level59 level8 level67)
(sum level59 level9 level68)
(sum level59 level12 level71)
(sum level59 level13 level72)
(sum level59 level14 level73)
(sum level60 level1 level61)
(sum level60 level3 level63)
(sum level60 level6 level66)
(sum level60 level7 level67)
(sum level60 level8 level68)
(sum level60 level9 level69)
(sum level60 level12 level72)
(sum level60 level13 level73)
(sum level60 level14 level74)
(sum level61 level1 level62)
(sum level61 level3 level64)
(sum level61 level6 level67)
(sum level61 level7 level68)
(sum level61 level8 level69)
(sum level61 level9 level70)
(sum level61 level12 level73)
(sum level61 level13 level74)
(sum level61 level14 level75)
(sum level62 level1 level63)
(sum level62 level3 level65)
(sum level62 level6 level68)
(sum level62 level7 level69)
(sum level62 level8 level70)
(sum level62 level9 level71)
(sum level62 level12 level74)
(sum level62 level13 level75)
(sum level63 level1 level64)
(sum level63 level3 level66)
(sum level63 level6 level69)
(sum level63 level7 level70)
(sum level63 level8 level71)
(sum level63 level9 level72)
(sum level63 level12 level75)
(sum level64 level1 level65)
(sum level64 level3 level67)
(sum level64 level6 level70)
(sum level64 level7 level71)
(sum level64 level8 level72)
(sum level64 level9 level73)
(sum level65 level1 level66)
(sum level65 level3 level68)
(sum level65 level6 level71)
(sum level65 level7 level72)
(sum level65 level8 level73)
(sum level65 level9 level74)
(sum level66 level1 level67)
(sum level66 level3 level69)
(sum level66 level6 level72)
(sum level66 level7 level73)
(sum level66 level8 level74)
(sum level66 level9 level75)
(sum level67 level1 level68)
(sum level67 level3 level70)
(sum level67 level6 level73)
(sum level67 level7 level74)
(sum level67 level8 level75)
(sum level68 level1 level69)
(sum level68 level3 level71)
(sum level68 level6 level74)
(sum level68 level7 level75)
(sum level69 level1 level70)
(sum level69 level3 level72)
(sum level69 level6 level75)
(sum level70 level1 level71)
(sum level70 level3 level73)
(sum level71 level1 level72)
(sum level71 level3 level74)
(sum level72 level1 level73)
(sum level72 level3 level75)
(sum level73 level1 level74)
(sum level74 level1 level75)

(connected l0 l6)
(fuelcost level14 l0 l6)
(connected l1 l5)
(fuelcost level12 l1 l5)
(connected l1 l8)
(fuelcost level9 l1 l8)
(connected l1 l11)
(fuelcost level3 l1 l11)
(connected l2 l3)
(fuelcost level23 l2 l3)
(connected l2 l4)
(fuelcost level13 l2 l4)
(connected l2 l7)
(fuelcost level6 l2 l7)
(connected l2 l10)
(fuelcost level21 l2 l10)
(connected l3 l2)
(fuelcost level23 l3 l2)
(connected l3 l12)
(fuelcost level8 l3 l12)
(connected l4 l2)
(fuelcost level13 l4 l2)
(connected l4 l5)
(fuelcost level7 l4 l5)
(connected l4 l7)
(fuelcost level1 l4 l7)
(connected l4 l8)
(fuelcost level17 l4 l8)
(connected l4 l9)
(fuelcost level6 l4 l9)
(connected l4 l10)
(fuelcost level25 l4 l10)
(connected l4 l12)
(fuelcost level13 l4 l12)
(connected l5 l1)
(fuelcost level12 l5 l1)
(connected l5 l4)
(fuelcost level7 l5 l4)
(connected l5 l7)
(fuelcost level8 l5 l7)
(connected l5 l11)
(fuelcost level18 l5 l11)
(connected l6 l0)
(fuelcost level14 l6 l0)
(connected l6 l8)
(fuelcost level6 l6 l8)
(connected l7 l2)
(fuelcost level6 l7 l2)
(connected l7 l4)
(fuelcost level1 l7 l4)
(connected l7 l5)
(fuelcost level8 l7 l5)
(connected l8 l1)
(fuelcost level9 l8 l1)
(connected l8 l4)
(fuelcost level17 l8 l4)
(connected l8 l6)
(fuelcost level6 l8 l6)
(connected l9 l4)
(fuelcost level6 l9 l4)
(connected l10 l2)
(fuelcost level21 l10 l2)
(connected l10 l4)
(fuelcost level25 l10 l4)
(connected l10 l12)
(fuelcost level12 l10 l12)
(connected l11 l1)
(fuelcost level3 l11 l1)
(connected l11 l5)
(fuelcost level18 l11 l5)
(connected l12 l3)
(fuelcost level8 l12 l3)
(connected l12 l4)
(fuelcost level13 l12 l4)
(connected l12 l10)
(fuelcost level12 l12 l10)

(at t0 l10)
(fuel t0 level75)
(= (total-cost) 0)

(at p0 l2)
(at p1 l5)
)

(:goal
(and
(at p0 l7)
(at p1 l11)
)
)
(:metric minimize (total-cost)))

; plan
1. (drive t0 l10 l2 level54 level21 level75)
   deleted: (at t0 l10) (fuel t0 level75)
   added: (at t0 l2) (fuel t0 level54)
   goals met: 0 of 2
2. (load p0 t0 l2)
   deleted: (at p0 l2)
   added: (in p0 t0)
   goals met: 0 of 2
3. (drive t0 l2 l7 level48 level6 level54)
   deleted: (at t0 l2) (fuel t0 level54)
   added: (at t0 l7) (fuel t0 level48)
   goals met: 0 of 2
4. (unload p0 t0 l7)
   deleted: (in p0 t0)
   added: (at p0 l7)
   goals met: 1 of 2
5. (drive t0 l7 l5 level40 level8 level48)
   deleted: (at t0 l7) (fuel t0 level48)
   added: (at t0 l5) (fuel t0 level40)
   goals met: 1 of 2
6. (load p1 t0 l5)
   deleted: (at p1 l5)
   added: (in p1 t0)
   goals met: 1 of 2
7. (drive t0 l5 l11 level22 level18 level40)
   deleted: (at t0 l5) (fuel t0 level40)
   added: (at t0 l11) (fuel t0 level22)
   goals met: 1 of 2
8. (unload p1 t0 l11)
   deleted: (in p1 t0)
   added: (at p1 l11)
   goals met: 2 of 2
